nxp-mcuxpresso/mcux-soc-svd/MCXA143/MCXA143.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>GLIKEY0</name>
      <description>GLIKEY</description>
      <groupName>IP_GLIKEY</groupName>
      <baseAddress>0x40091D00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GLIKEY0</name>
        <value>13</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL_0</name>
          <description>Control Register 0 SFR</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0x700FF</resetMask>
          <fields>
            <field>
              <name>WRITE_INDEX</name>
              <description>Write Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>Reserved for Future Use</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_EN_0</name>
              <description>Write Enable 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFT_RST</name>
              <description>Soft reset for the core reset (SFR configuration will be preseved).This register reads as 0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Triggers the soft reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED31</name>
              <description>Reserved for Future Use</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_1</name>
          <description>Control Regsiter 1 SFR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x280000</resetValue>
          <resetMask>0x3F00FF</resetMask>
          <fields>
            <field>
              <name>READ_INDEX</name>
              <description>Index status, Writing an index value to this register will request the block to return the lock status of this index.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED15</name>
              <description>Reserved for Future Use</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WR_EN_1</name>
              <description>Write Enable One</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFR_LOCK</name>
              <description>LOCK register for GLIKEY</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESERVED31</name>
              <description>Reserved for Future Use</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_CTRL</name>
          <description>Interrupt Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>INT_EN</name>
              <description>Interrupt Enable. Writing a 1, Interrupt asserts on Interrupt output port</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_CLR</name>
              <description>Interrupt Clear. Writing a 1 to this register creates a single interrupt clear pulse. This register reads as 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INT_SET</name>
              <description>Interrupt Set. Writing a 1 to this register asserts the interrupt. This register reads as 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Triggers interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED31</name>
              <description>Reserved for Future Use</description>
              <bitOffset>3</bitOffset>
              <bitWidth>29</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xB00000</resetValue>
          <resetMask>0xFFF8001F</resetMask>
          <fields>
            <field>
              <name>INT_STATUS</name>
              <description>Interrupt Status.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Triggers interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_STATUS</name>
              <description>Provides the current lock status of indexes.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK0</name>
                  <description>Current read index is not locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK1</name>
                  <description>Current read index is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERROR_STATUS</name>
              <description>Status of the Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STAT0</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAT1</name>
                  <description>FSM error has occurred</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAT2</name>
                  <description>Write index out of the bound (OOB) error</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAT3</name>
                  <description>Write index OOB and FSM error</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAT4</name>
                  <description>Read index OOB error</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAT5</name>
                  <description>Write index and read index OOB error</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STAT6</name>
                  <description>Read index OOB, write index OOB, and FSM error</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESERVED18</name>
              <description>Reserved for Future Use</description>
              <bitOffset>5</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_STATE</name>
              <description>Status of FSM</description>
              <bitOffset>19</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>IP Version</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x7B0100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Reserved3</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved7</name>
              <description>Reserved</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved11</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved15</name>
              <description>Reserved</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved16</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_CONFIG</name>
              <description>0:4 step, 1:8 step</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INDEX_CONFIG</name>
              <description>Configured number of addressable indexes</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved31</name>
              <description>Reserved for Future Use</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
